{
    "extName": {
        "message": "Target Blank Alert",
        "description": "The name of the extension."
    },
    "extDescription": {
        "message": "Target Blank Alert warns users about the target _blank vulnerability",
        "description": "The description of the extension."
    },
    "extAuthor": {
        "message": "i3visio (Yaiza Rubio and Félix Brezo)",
        "description": "The authors of the extension."
    },
    "extAboutText": {
        "message": "We are a team of Open Sources analysts focused on making life easier for other intelligence analysts. The brand we use is <a href=\"http://i3visio.com\">i3visio</a>. If you are curious, you can find more info about us and other projects in which we are involved here:",
        "description": "The HTML code to be shown in the about page (without the social links)."
    },
    "footerLicensed": {
        "message": "This extension is licensed under <a href='http://www.gnu.org/licenses/gpl-3.0.txt'>GPLv3+</a>.",
        "description": "The HTML code to be shown in the license disclaimer in the footer."
    },
    "footerCode": {
        "message": "Code",
        "description": "The text to be shown when linking to the code in the footer."
    },
    "footerIssues": {
        "message": "Issues",
        "description": "The text to be shown when linking to the issues Github page in the footer."
    },
    "badgeTitle": {
        "message": "Target Blank Alert",
        "description": "The name of the extension as it will be shown in the badge appearing in the toolbar."
    },
    
    "texInfo": {
        "message": "Is this website safe?",
        "description": "A translation for the info tab."
    },
    "texAbout": {
        "message": "FAQ",
        "description": "A translation for about."
    },
    "questionFaq1": {
        "message": "What does this extension do?",
        "description": "A question."
    },
    "answerFaq1": {
        "message": "The extension is a tiny piece of javascript code that can be found <a href='https://github.com/i3visio/target-blank-alert/blob/master/js/content.js' target='_blank' rel='noreferrer noopener'>here</a> that verifies the content of the websites you visit looking for badly configured links with the attribute <code>target='_blank'</code>.",
        "description": "An answer."
    },
    "questionFaq2": {
        "message": "Did you say <code>target='_blank'</code>?",
        "description": "Another question."
    },
    "answerFaq2": {
        "message": "This attribute corresponds to a HTML option that tells the browser to open the corresponding link in a new tab instead of using the current tab.",
        "description": "Another answer."
    },
    "questionFaq3": {
        "message": "How does this vulnerability work?",
        "description": "Another question."
    },
    "answerFaq3": {
        "message": "Main browsers currently allow a misusage of this characteristic that would allow anyone sending a link to, not only opening the link in a new tab, but also refreshing the current tab to any other arbitrary website in the background. This is an issue that can be useful when conducting phishing attacks focused on credential harvesting. In <a href='https://dev.to/ben/the-targetblank-vulnerability-by-example' target='_blank' rel='noreferrer noopener'>this link</a> an expert provides a full example that shows the issue by providing a crafted link via Facebook.",
        "description": "Another answer."
    },
    "questionFaq4": {
        "message": "What can I do to protect me?",
        "description": "Another question."
    },    
    "answerFaq4": {
        "message": "First of all, awareness. The user should know that although some websites such as Instagram have already addressed this issue (by setting special attributes to this type of links including the safer <code>rel='noreferrer noopener'</code, others have not worked on that yet. This extension will let you know about how many suspicious links can be found in each website. Awareness is the best way, so if you have found that a website has not fixed this yet, contact with the administrator.",
        "description": "Another answer."
    },
    "texCheckFAQ": {
        "message": "If you had questions about what does this mean, you can check the Frequent Asked Questions section.",
        "description": "Text introducing the FAQ."
    },    
    "texContact": {
        "message": "Contact the admin",
        "description": "Text of the button to contact the admin."
    },
    "texTweet": {
        "message": "Tweet this!",
        "description": "Text of the button to tweet the story."
    },
    "texNoErrors": {
        "message": "Nice! No suspicious link was found on this website.",
        "description": "Text of the success notice."
    },
    "texRelation": {
        "message": "This is the count of missing values in the <code>rel</code> attribute of the misconfigured links identified",
        "description": "Text of the additional notes introduction."
    },
    "texErrors1": {
        "message": "Ooops! The extension has found ",
        "description": "Text of the first part of the error message."
    },
    "texErrors2": {
        "message": " misconfigured links.",
        "description": "Text of the second part of the error mesdage."
    },
    "texVulnFound": {
        "message": " I have just found some misconfigured links in a website using Target Blank Alert",
        "description": "Text to be shown in the tweet when a vulnerable link has been found."
    },
    "texVulnNotFound": {
        "message": " I have checked that this website doesn't have any misconfigured links using Target Blank Alert",
        "description": "Text to be shown in the tweet when NO vulnerable link has been found."
    }   
}
